Documents/ЛБ_УстановкаПредельныхСуммДляИдентификацииКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_УстановкаПредельныхСуммДляИдентификацииКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_ПредельныеСуммыДляИдентификацииКлиента</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредельныеСуммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_СпособыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредельнаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЛБ_УстановкаПредельныхСуммДляИдентификацииКлиента/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ТекПользователь = ПараметрыСеанса.ТекущийПользователь;   
	Если ТекПользователь.ЭтоЛомбард Тогда 
		ОбщегоНазначения.СообщитьПользователю("Документ «Установка предельных сумм для идентификации клиента в реализации» доступен только сотрудникам ЦО.");
		Отказ = Истина;  
	ИначеЕсли НЕ УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
		ОбщегоНазначения.СообщитьПользователю("Документ «Установка предельных сумм для идентификации клиента в реализации» доступен только сотрудникам ЦО.");
		Отказ = Истина;  
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = ТекПользователь; 
		Объект.Дата = ТекущаяДатаСеанса();  
		ЗаполнитьТаблицу();
    КонецЕсли;
	УстановитьСостояниеДокумента();    
	               	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры   
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры          

&НаСервере
Процедура ЗаполнитьТаблицу() 
	Для Каждого ЗначениеП Из Метаданные.Перечисления.ЛБ_СпособыОплаты.ЗначенияПеречисления Цикл   
		НоваяСтр = Объект.ПредельныеСуммы.Добавить(); 
		НоваяСтр.Использовать = Истина; 
		НоваяСтр.СпособОплаты = Перечисления.ЛБ_СпособыОплаты[ЗначениеП.Имя]; 
    КонецЦикла; 	 
КонецПроцедуры 	

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)  
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		// проверим заполнение таб. части 
		ЕстьИспользовать = Ложь;
		Для каждого стр Из Объект.ПредельныеСуммы Цикл
			Если стр.Использовать Тогда 
				ЕстьИспользовать = Истина; 
				Прервать;
			КонецЕсли;	
		КонецЦикла;    
		
		Если НЕ ЕстьИспользовать Тогда
			Предупреждение("Не выбраны способы оплаты для которых устанавливаются предельные суммы.", 60);
            Отказ = Истина;
		Иначе	
			Для каждого стр Из Объект.ПредельныеСуммы Цикл  
				Если стр.Использовать И Стр.ПредельнаяСумма = 0 Тогда 
					Отказ = Истина;
					Прервать;
				КонецЕсли;	
			Конеццикла;      
			
			Если Отказ Тогда
				Предупреждение("Для всех выбранных способов оплаты нужно заполнить предельные суммы.", 60);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
